# TODO: Intermediate Python (Промежуточный Python)
#  Если вы уже знакомы с основами Python и хотите расширить свои знания, этот курс для вас.
#  Вы узнаете о типах коллекций Python, лямбда-функциях, генераторах, декораторах,
#  объектно-ориентированном программировании и многом другом.

# TODO: Welcome! (Добро пожаловать!)
#  Добро пожаловать на курс Python для среднего уровня.
#  В этом курсе вы узнаете о типах коллекций Python, лямбда-функциях, генераторах, декораторах, ООП и многом другом.
#  Мы также создадим реальные проекты и решим несколько задач программирования.
#  Этот курс предназначен для разработчиков Python среднего уровня,
#  которые уже знают основы Python и хотят расширить свои знания.
#  Если вы новичок в Python, мы предлагаем вам начать с нашего курса Python для начинающих.
n = [2, 4, 6, 8]
res = 1
for x in n[1:3]:
    res *= x

print(res)
