# TODO: Python for Finance (Python для финансов)
#  В Python есть множество пакетов, особенно полезных при работе с финансовыми данными.
#  В этом курсе мы узнаем, как Python можно использовать в финансах для решения различных проблем и проведения
#  финансового анализа. Кроме того, в качестве практического проекта мы создадим программу для анализа цены биткойнов!

# TODO: Welcome (Добро пожаловать)
#  Умение программировать действительно полезно для многих дисциплин, включая финансы.
#  С его помощью можно легко получать финансовые данные, рассчитывать метрики, генерировать отчеты,
#  автоматизировать различные задачи и проводить финансовый анализ.
#  В этом курсе мы узнаем, как Python можно использовать в финансах для решения различных финансовых проблем.
#  В качестве предварительного условия для этого курса мы ожидаем, что вы знаете основы финансов.
#  Мы также рассмотрим различные концепции Python, прежде чем показать их в действии.

# TODO: Why Python (Почему Python)
#  Python — один из самых популярных языков программирования в мире,
#  так как он прост в освоении и имеет простой синтаксис.
#  Например, вот код, используемый для вычисления и вывода результата умножения 123 на 456:
# print(123 * 456)

# TODO: Output (Выход)
#  Оператор печати используется для генерации вывода.
#  Это может быть число, текст или результат вычисления:
#  За оператором печати всегда следуют круглые скобки, содержащие вывод, который мы хотим сгенерировать.
# print(42)

# TODO: Printing Text (Печать текста)
#  При печати текста его необходимо заключать в одинарные или двойные кавычки.
#  Текст в кавычках называется строкой.
#  Кавычки, окружающие текст, должны быть одинаковыми: либо одинарными, либо двойными.
# print("Python is cool")

# TODO: Обратите внимание, что оператор печати заключает текст, который мы хотим вывести, в круглые скобки.
#  Всегда не забывайте закрывать открытые скобки — без них оператор печати не будет работать.
# print("Welcome")

# TODO: Projects (Проекты)
#  В ходе этого курса мы изучим основы Python, используя его для решения нескольких
#  реальных финансовых проблем и выполнения расчетов.
#  Вот некоторые из проектов, которые мы рассмотрим:
#  - Расчет основных финансовых показателей
#  - Построение графиков на основе финансовых данных
#  - Получение и анализ цен на акции
#  - Выполнение финансового анализа акций и портфелей, включая доходность акций, корреляции, анализ рисков
#  - Оптимизация портфеля с использованием моделирования Монте-Карло
#  В качестве практического проекта мы создадим программу для анализа цены биткойнов!
#  Навыки, полученные в ходе этого курса, могут быть использованы для решения множества различных финансовых проблем,
#  создания отчетов и помощи в принятии решений.

# TODO: ЗАДАЧА: Начиная
#  Давайте практиковаться, кодируя по-настоящему!
#  Мы начнем с простого вывода текста, чтобы познакомить вас со средой Code Playground,
#  чтобы вы могли написать свой первый настоящий код.
#  Задание Исправьте программу для вывода цитаты:
#  Инвестиции в знания окупаются с наибольшей выгодой.
# print('An investment in knowledge pays the best interest.')
