"""
Python for Data Science:
Python широко используется в науке о данных и имеет надежный набор мощных инструментов для обмена данными.
В этом курсе вы узнаете о различных библиотеках Python, используемых для обработки и визуализации данных,
таких как numpy, pandas, matplotlib и других.
"""

# TODO: Добро пожаловать на наш курс Python для науки о данных!
#  В этом курсе вы узнаете о самых популярных библиотеках Python,
#  используемых в науке о данных: numpy , pandas и matplotlib .
#  Мы будем решать реальные проблемы, решать задачи, анализировать реальные данные и визуализировать полученные данные!
#  Если вы не знакомы с базовым синтаксисом Python,
#  лучше сначала пройти наши курсы Python для начинающих и Структуры данных Python , прежде чем начинать этот.

